#include "enclatin.h"

/*******************************************************************************
 * headers
 */

#include <uchar.h>

#include <decomp.h>

#include <revolution/enc.h>
#include "encmacros.h"
#include "encutility.h"

/*******************************************************************************
 * macros
 */

#undef NULL
#define NULL	((void *)(0))

// So it continues to look pretty
#define NBSP	L'\u00A0'	// U+00A0 NO-BREAK SPACE
#define SFHY	L'\u00AD'	// U+00AD SOFT HYPHEN

// TODO: What are these about
#define F8A0	L'\uF8A0'	// <Private Use>
#define F8F9	L'\uF8F9'	// <Private Use>
#define F8FA	L'\uF8FA'	// <Private Use>
#define F8FB	L'\uF8FB'	// <Private Use>

#define DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(src_, srcChar_, table_)			\
	ENCResult ENCiConvertString ## src_ ## ToUnicode(						\
		char16_t *dst, unk4_t signed *dstSize, srcChar_ const *src,			\
		unk4_t signed *srcSize, ENCBreakType breakType)						\
	{																		\
		return ENCiConvertStringLatinToUnicode(								\
			dst, dstSize, src, srcSize, breakType, table_);					\
	}

#define DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(dst_, dstChar_,				\
										   table_)							\
	ENCResult ENCiConvertStringUnicodeTo ## dst_(							\
		dstChar_ *dst, unk4_t signed *dstSize, char16_t const *src,			\
		unk4_t signed *srcSize, ENCBreakType breakType)						\
	{																		\
		return ENCiConvertStringUnicodeToLatin(								\
			dst, dstSize, src, srcSize, breakType, table_);					\
	}

/*******************************************************************************
 * local function declarations
 */

static unsigned char ENCiGetLatinCharFromHashTable(
	struct hash_table const *table, char16_t src);

/*******************************************************************************
 * variables
 */

// clang-format off

// .rodata

// These arrays are the lookup tables of the upper half of these code pages.

// ISO-8859-1
char16_t const latin1_unicode_array[] =
{
	L'€', 0x81, L'‚', L'ƒ', L'„', L'…', L'†', L'‡', L'ˆ', L'‰', L'Š', L'‹', L'Œ', 0x8D, L'Ž', 0x8F,
	0x90, L'‘', L'’', L'“', L'”', L'•', L'–', L'—', L'˜', L'™', L'š', L'›', L'œ', 0x9D, L'ž', L'Ÿ',
	0xA0, L'¡', L'¢', L'£', L'¤', L'¥', L'¦', L'§', L'¨', L'©', L'ª', L'«', L'¬', 0xAD, L'®', L'¯',
	L'°', L'±', L'²', L'³', L'´', L'µ', L'¶', L'·', L'¸', L'¹', L'º', L'»', L'¼', L'½', L'¾', L'¿', 
	L'À', L'Á', L'Â', L'Ã', L'Ä', L'Å', L'Æ', L'Ç', L'È', L'É', L'Ê', L'Ë', L'Ì', L'Í', L'Î', L'Ï',
	L'Ð', L'Ñ', L'Ò', L'Ó', L'Ô', L'Õ', L'Ö', L'×', L'Ø', L'Ù', L'Ú', L'Û', L'Ü', L'Ý', L'Þ', L'ß',
	L'à', L'á', L'â', L'ã', L'ä', L'å', L'æ', L'ç', L'è', L'é', L'ê', L'ë', L'ì', L'í', L'î', L'ï',
	L'ð', L'ñ', L'ò', L'ó', L'ô', L'õ', L'ö', L'÷', L'ø', L'ù', L'ú', L'û', L'ü', L'ý', L'þ', L'ÿ'
};

// ISO-8859-2
char16_t const latin2_unicode_array[] =
{
	0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8A, 0x8B, 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9A, 0x9B, 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, L'Ą', L'˘', L'Ł', 0xA4, L'Ľ', L'Ś', 0xA7, 0xA8, L'Š', L'Ş', L'Ť', L'Ź', 0xAD, L'Ž', L'Ż',
	0xB0, L'ą', L'˛', L'ł', 0xB4, L'ľ', L'ś', L'ˇ', 0xB8, L'š', L'ş', L'ť', L'ź', L'˝', L'ž', L'ż',
	L'Ŕ', 0xC1, 0xC2, L'Ă', 0xC4, L'Ĺ', L'Ć', 0xC7, L'Č', 0xC9, L'Ę', 0xCB, L'Ě', 0xCD, 0xCE, L'Ď',
	L'Đ', L'Ń', L'Ň', 0xD3, 0xD4, L'Ő', 0xD6, 0xD7, L'Ř', L'Ů', 0xDA, L'Ű', 0xDC, 0xDD, L'Ţ', 0xDF,
	L'ŕ', 0xE1, 0xE2, L'ă', 0xE4, L'ĺ', L'ć', 0xE7, L'č', 0xE9, L'ę', 0xEB, L'ě', 0xED, 0xEE, L'ď',
	L'đ', L'ń', L'ň', 0xF3, 0xF4, L'ő', 0xF6, 0xF7, L'ř', L'ů', 0xFA, L'ű', 0xFC, 0xFD, L'ţ', L'˙'
};

// ISO-8859-3
char16_t const latin3_unicode_array[] =
{
	0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8A, 0x8B, 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9A, 0x9B, 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, L'Ħ', L'˘', 0xA3, 0xA4, L'', L'Ĥ', 0xA7, 0xA8, L'İ', L'Ş', L'Ğ', L'Ĵ', 0xAD, L'', L'Ż',
	0xB0, L'ħ', 0xB2, 0xB3, 0xB4, 0xB5, L'ĥ', 0xB7, 0xB8, L'ı', L'ş', L'ğ', L'ĵ', 0xBD, L'', L'ż',
	0xC0, 0xC1, 0xC2, L'', 0xC4, L'Ċ', L'Ĉ', 0xC7, 0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF,
	L'', 0xD1, 0xD2, 0xD3, 0xD4, L'Ġ', 0xD6, 0xD7, L'Ĝ', 0xD9, 0xDA, 0xDB, 0xDC, L'Ŭ', L'Ŝ', 0xDF,
	0xE0, 0xE1, 0xE2, L'', 0xE4, L'ċ', L'ĉ', 0xE7, 0xE8, 0xE9, 0xEA, 0xEB, 0xEC, 0xED, 0xEE, 0xEF,
	L'', 0xF1, 0xF2, 0xF3, 0xF4, L'ġ', 0xF6, 0xF7, L'ĝ', 0xF9, 0xFA, 0xFB, 0xFC, L'ŭ', L'ŝ', L'˙'
};

// ISO-8859-7
char16_t const greek_unicode_array[] =
{
	0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8A, 0x8B, 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9A, 0x9B, 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, L'ʽ', L'ʼ', 0xA3, L'', L'', 0xA6, 0xA7, 0xA8, 0xA9, L'', 0xAB, 0xAC, 0xAD, L'', L'―',
	0xB0, 0xB1, 0xB2, 0xB3, L'΄', L'΅', L'Ά', 0xB7, L'Έ', L'Ή', L'Ί', 0xBB, L'Ό', 0xBD, L'Ύ', L'Ώ',
	L'ΐ', L'Α', L'Β', L'Γ', L'Δ', L'Ε', L'Ζ', L'Η', L'Θ', L'Ι', L'Κ', L'Λ', L'Μ', L'Ν', L'Ξ', L'Ο',
	L'Π', L'Ρ', L'', L'Σ', L'Τ', L'Υ', L'Φ', L'Χ', L'Ψ', L'Ω', L'Ϊ', L'Ϋ', L'ά', L'έ', L'ή', L'ί',
	L'ΰ', L'α', L'β', L'γ', L'δ', L'ε', L'ζ', L'η', L'θ', L'ι', L'κ', L'λ', L'μ', L'ν', L'ξ', L'ο',
	L'π', L'ρ', L'ς', L'σ', L'τ', L'υ', L'φ', L'χ', L'ψ', L'ω', L'ϊ', L'ϋ', L'ό', L'ύ', L'ώ', L''
};

// ISO-8859-10
char16_t const latin6_unicode_array[] =
{
	0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8A, 0x8B, 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9A, 0x9B, 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, L'Ą', L'Ē', L'Ģ', L'Ī', L'Ĩ', L'Ķ', 0xA7, L'Ļ', L'Đ', L'Š', L'Ŧ', L'Ž', 0xAD, L'Ū', L'Ŋ',
	0xB0, L'ą', L'ē', L'ģ', L'ī', L'ĩ', L'ķ', 0xB7, L'ļ', L'đ', L'š', L'ŧ', L'ž', L'―', L'ū', L'ŋ',
	L'Ā', 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, L'Į', L'Č', 0xC9, L'Ę', 0xCB, L'Ė', 0xCD, 0xCE, 0xCF,
	0xD0, L'Ņ', L'Ō', 0xD3, 0xD4, 0xD5, 0xD6, L'Ũ', 0xD8, L'Ų', 0xDA, 0xDB, 0xDC, 0xDD, 0xDE, 0xDF,
	L'ā', 0xE1, 0xE2, 0xE3, 0xE4, 0xE5, 0xE6, L'į', L'č', 0xE9, L'ę', 0xEB, L'ė', 0xED, 0xEE, 0xEF,
	0xF0, L'ņ', L'ō', 0xF3, 0xF4, 0xF5, 0xF6, L'ũ', 0xF8, L'ų', 0xFA, 0xFB, 0xFC, 0xFD, 0xFE, L'ĸ'
};

// ISO-8859-15
char16_t const latin9_unicode_array[] =
{
	0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8A, 0x8B, 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, 0x91, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98, 0x99, 0x9A, 0x9B, 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, 0xA1, 0xA2, 0xA3, L'€', 0xA5, L'Š', 0xA7, L'š', 0xA9, 0xAA, 0xAB, 0xAC, 0xAD, 0xAE, 0xAF,
	0xB0, 0xB1, 0xB2, 0xB3, L'Ž', 0xB5, 0xB6, 0xB7, L'ž', 0xB9, 0xBA, 0xBB, L'Œ', L'œ', L'Ÿ', 0xBF,
	0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF,
	0xD0, 0xD1, 0xD2, 0xD3, 0xD4, 0xD5, 0xD6, 0xD7, 0xD8, 0xD9, 0xDA, 0xDB, 0xDC, 0xDD, 0xDE, 0xDF,
	0xE0, 0xE1, 0xE2, 0xE3, 0xE4, 0xE5, 0xE6, 0xE7, 0xE8, 0xE9, 0xEA, 0xEB, 0xEC, 0xED, 0xEE, 0xEF,
	0xF0, 0xF1, 0xF2, 0xF3, 0xF4, 0xF5, 0xF6, 0xF7, 0xF8, 0xF9, 0xFA, 0xFB, 0xFC, 0xFD, 0xFE, 0xFF
};

// windows-1250
char16_t const win1250_unicode_array[] =
{
	L'€', 0x81, L'‚', 0x83, L'„', L'…', L'†', L'‡', 0x88, L'‰', L'Š', L'‹', L'Ś', L'Ť', L'Ž', L'Ź',
	0x90, L'‘', L'’', L'“', L'”', L'•', L'–', L'—', 0x98, L'™', L'š', L'›', L'ś', L'ť', L'ž', L'ź',
	0xA0, L'ˇ', L'˘', L'Ł', 0xA4, L'Ą', 0xA6, 0xA7, 0xA8, 0xA9, L'Ş', 0xAB, 0xAC, 0xAD, 0xAE, L'Ż',
	0xB0, 0xB1, L'˛', L'ł', 0xB4, 0xB5, 0xB6, 0xB7, 0xB8, L'ą', L'ş', 0xBB, L'Ľ', L'˝', L'ľ', L'ż',
	L'Ŕ', 0xC1, 0xC2, L'Ă', 0xC4, L'Ĺ', L'Ć', 0xC7, L'Č', 0xC9, L'Ę', 0xCB, L'Ě', 0xCD, 0xCE, L'Ď',
	L'Đ', L'Ń', L'Ň', 0xD3, 0xD4, L'Ő', 0xD6, 0xD7, L'Ř', L'Ů', 0xDA, L'Ű', 0xDC, 0xDD, L'Ţ', 0xDF,
	L'ŕ', 0xE1, 0xE2, L'ă', 0xE4, L'ĺ', L'ć', 0xE7, L'č', 0xE9, L'ę', 0xEB, L'ě', 0xED, 0xEE, L'ď',
	L'đ', L'ń', L'ň', 0xF3, 0xF4, L'ő', 0xF6, 0xF7, L'ř', L'ů', 0xFA, L'ű', 0xFC, 0xFD, L'ţ', L'˙'
};

// windows-1253
char16_t const win1253_unicode_array[] =
{
	L'€', 0x81, L'‚', L'ƒ', L'„', L'…', L'†', L'‡', 0x88, L'‰', 0x8A, L'‹', 0x8C, 0x8D, 0x8E, 0x8F,
	0x90, L'‘', L'’', L'“', L'”', L'•', L'–', L'—', 0x98, L'™', 0x9A, L'›', 0x9C, 0x9D, 0x9E, 0x9F,
	0xA0, L'΅', L'Ά', 0xA3, 0xA4, 0xA5, 0xA6, 0xA7, 0xA8, 0xA9, F8F9, 0xAB, 0xAC, 0xAD, 0xAE, L'―',
	0xB0, 0xB1, 0xB2, 0xB3, L'΄', 0xB5, 0xB6, 0xB7, L'Έ', L'Ή', L'Ί', 0xBB, L'Ό', 0xBD, L'Ύ', L'Ώ',
	L'ΐ', L'Α', L'Β', L'Γ', L'Δ', L'Ε', L'Ζ', L'Η', L'Θ', L'Ι', L'Κ', L'Λ', L'Μ', L'Ν', L'Ξ', L'Ο',
	L'Π', L'Ρ', F8FA, L'Σ', L'Τ', L'Υ', L'Φ', L'Χ', L'Ψ', L'Ω', L'Ϊ', L'Ϋ', L'ά', L'έ', L'ή', L'ί',
	L'ΰ', L'α', L'β', L'γ', L'δ', L'ε', L'ζ', L'η', L'θ', L'ι', L'κ', L'λ', L'μ', L'ν', L'ξ', L'ο',
	L'π', L'ρ', L'ς', L'σ', L'τ', L'υ', L'φ', L'χ', L'ψ', L'ω', L'ϊ', L'ϋ', L'ό', L'ύ', L'ώ', F8FB
};

// macintosh ("Mac Roman", not "Macro Man"; although I am a bit of a preprocessor macro lass, myself...)
char16_t const macroman_unicode_array[] =
{
	L'Ä', L'Å', L'Ç', L'É', L'Ñ', L'Ö', L'Ü', L'á', L'à', L'â', L'ä', L'ã', L'å', L'ç', L'é', L'è',
	L'ê', L'ë', L'í', L'ì', L'î', L'ï', L'ñ', L'ó', L'ò', L'ô', L'ö', L'õ', L'ú', L'ù', L'û', L'ü',
	L'†', L'°', L'¢', L'£', L'§', L'•', L'¶', L'ß', L'®', L'©', L'™', L'´', L'¨', L'≠', L'Æ', L'Ø',
	L'∞', L'±', L'≤', L'≥', L'¥', L'µ', L'∂', L'∑', L'∏', L'π', L'∫', L'ª', L'º', L'Ω', L'æ', L'ø',
	L'¿', L'¡', L'¬', L'√', L'ƒ', L'≈', L'∆', L'«', L'»', L'…', NBSP, L'À', L'Ã', L'Õ', L'Œ', L'œ',
	L'–', L'—', L'“', L'”', L'‘', L'’', L'÷', L'◊', L'ÿ', L'Ÿ', L'⁄', L'€', L'‹', L'›', L'ﬁ', L'ﬂ',
	L'‡', L'·', L'‚', L'„', L'‰', L'Â', L'Ê', L'Á', L'Ë', L'È', L'Í', L'Î', L'Ï', L'Ì', L'Ó', L'Ô',
	L'', L'Ò', L'Ú', L'Û', L'Ù', L'ı', L'ˆ', L'˜', L'¯', L'˘', L'˙', L'˚', L'¸', L'˝', L'˛', L'ˇ'
};

// Mac OS Greek (No MIME entry. On Windows, this is code page 10006.)
char16_t const macgreek_unicode_array[] =
{
	L'Ä', L'¹', L'²', L'É', L'³', L'Ö', L'Ü', L'΅', L'à', L'â', L'ä', L'΄', L'¨', L'ç', L'é', L'è',
	L'ê', L'ë', L'£', L'™', L'î', L'ï', L'•', L'½', L'‰', L'ô', L'ö', L'¦', SFHY, L'ù', L'û', L'ü',
	L'†', L'Γ', L'Δ', L'Θ', L'Λ', L'Ξ', L'Π', L'ß', L'®', L'©', L'Σ', L'Ϊ', L'§', L'≠', L'°', L'·',
	L'Α', L'±', L'≤', L'≥', L'¥', L'Β', L'Ε', L'Ζ', L'Η', L'Ι', L'Κ', L'Μ', L'Φ', L'Ϋ', L'Ψ', L'Ω',
	L'ά', L'Ν', L'¬', L'Ο', L'Ρ', L'≈', L'Τ', L'«', L'»', L'…', NBSP, L'Υ', L'Χ', L'Ά', L'Έ', L'œ',
	L'–', L'―', L'“', L'”', L'‘', L'’', L'÷', L'Ή', L'Ί', L'Ό', L'Ύ', L'έ', L'ή', L'ί', L'ό', L'Ώ',
	L'ύ', L'α', L'β', L'ψ', L'δ', L'ε', L'φ', L'γ', L'η', L'ι', L'ξ', L'κ', L'λ', L'μ', L'ν', L'ο',
	L'π', L'ώ', L'ρ', L'σ', L'τ', L'θ', L'ω', L'ς', L'χ', L'υ', L'ζ', L'ϊ', L'ϋ', L'ΐ', L'ΰ', F8A0
};

// Mac OS Central European (No MIME entry. On Windows, this is code page 10029.)
char16_t const macce_unicode_array[] =
{
	L'Ä', L'Ā', L'ā', L'É', L'Ą', L'Ö', L'Ü', L'á', L'ą', L'Č', L'ä', L'č', L'Ć', L'ć', L'é', L'Ź',
	L'ź', L'Ď', L'í', L'ď', L'Ē', L'ē', L'Ė', L'ó', L'ė', L'ô', L'ö', L'õ', L'ú', L'Ě', L'ě', L'ü',
	L'†', L'°', L'Ę', L'£', L'§', L'•', L'¶', L'ß', L'®', L'©', L'™', L'ę', L'¨', L'≠', L'ģ', L'Į',
	L'į', L'Ī', L'≤', L'≥', L'ī', L'Ķ', L'∂', L'∑', L'ł', L'Ļ', L'ļ', L'Ľ', L'ľ', L'Ĺ', L'ĺ', L'Ņ',
	L'ņ', L'Ń', L'¬', L'√', L'ń', L'Ň', L'∆', L'«', L'»', L'…', NBSP, L'ň', L'Ő', L'Õ', L'ő', L'Ō',
	L'–', L'—', L'“', L'”', L'‘', L'’', L'÷', L'◊', L'ō', L'Ŕ', L'ŕ', L'Ř', L'‹', L'›', L'ř', L'Ŗ',
	L'ŗ', L'Š', L'‚', L'„', L'š', L'Ś', L'ś', L'Á', L'Ť', L'ť', L'Í', L'Ž', L'ž', L'Ū', L'Ó', L'Ô',
	L'ū', L'Ů', L'Ú', L'ů', L'Ű', L'ű', L'Ų', L'ų', L'Ý', L'ý', L'ķ', L'Ż', L'Ł', L'ż', L'Ģ', L'ˇ'
};

// IBM850 (No preferred MIME name; this is the regular name.)
char16_t const ibm850_unicode_array[] =
{
	L'Ç', L'ü', L'é', L'â', L'ä', L'à', L'å', L'ç', L'ê', L'ë', L'è', L'ï', L'î', L'ì', L'Ä', L'Å',
	L'É', L'æ', L'Æ', L'ô', L'ö', L'ò', L'û', L'ù', L'ÿ', L'Ö', L'Ü', L'ø', L'£', L'Ø', L'×', L'ƒ',
	L'á', L'í', L'ó', L'ú', L'ñ', L'Ñ', L'ª', L'º', L'¿', L'®', L'¬', L'½', L'¼', L'¡', L'«', L'»',
	L'░', L'▒', L'▓', L'│', L'┤', L'Á', L'Â', L'À', L'©', L'╣', L'║', L'╗', L'╝', L'¢', L'¥', L'┐',
	L'└', L'┴', L'┬', L'├', L'─', L'┼', L'ã', L'Ã', L'╚', L'╔', L'╩', L'╦', L'╠', L'═', L'╬', L'¤',
	L'ð', L'Ð', L'Ê', L'Ë', L'È', L'ı', L'Í', L'Î', L'Ï', L'┘', L'┌', L'█', L'▄', L'¦', L'Ì', L'▀',
	L'Ó', L'ß', L'Ô', L'Ò', L'õ', L'Õ', L'µ', L'þ', L'Þ', L'Ú', L'Û', L'Ù', L'ý', L'Ý', L'¯', L'´',
	SFHY, L'±', L'‗', L'¾', L'¶', L'§', L'÷', L'¸', L'°', L'¨', L'·', L'¹', L'³', L'²', L'■', NBSP
};

// IBM852 (No preferred MIME name; this is the regular name.)
char16_t const ibm852_unicode_array[] =
{
	L'Ç', L'ü', L'é', L'â', L'ä', L'ů', L'ć', L'ç', L'ł', L'ë', L'Ő', L'ő', L'î', L'Ź', L'Ä', L'Ć',
	L'É', L'Ĺ', L'ĺ', L'ô', L'ö', L'Ľ', L'ľ', L'Ś', L'ś', L'Ö', L'Ü', L'Ť', L'ť', L'Ł', L'×', L'č',
	L'á', L'í', L'ó', L'ú', L'Ą', L'ą', L'Ž', L'ž', L'Ę', L'ę', L'¬', L'ź', L'Č', L'ş', L'«', L'»',
	L'░', L'▒', L'▓', L'│', L'┤', L'Á', L'Â', L'Ě', L'Ş', L'╣', L'║', L'╗', L'╝', L'Ż', L'ż', L'┐',
	L'└', L'┴', L'┬', L'├', L'─', L'┼', L'Ă', L'ă', L'╚', L'╔', L'╩', L'╦', L'╠', L'═', L'╬', L'¤',
	L'đ', L'Đ', L'Ď', L'Ë', L'ď', L'Ň', L'Í', L'Î', L'ě', L'┘', L'┌', L'█', L'▄', L'Ţ', L'Ů', L'▀',
	L'Ó', L'ß', L'Ô', L'Ń', L'ń', L'ň', L'Š', L'š', L'Ŕ', L'Ú', L'ŕ', L'Ű', L'ý', L'Ý', L'ţ', L'´',
	SFHY, L'˝', L'˛', L'ˇ', L'˘', L'§', L'÷', L'¸', L'°', L'¨', L'˙', L'ű', L'Ř', L'ř', L'■', NBSP
};

// These arrays are hash tables. Of some sort. Or so the function name says.

struct hash_table const unicode_latin1_array[] =
{
	{0x80, 0x80,   0}, {0x81, 0x81,   1}, {0x82, 0x82,   2}, {0x83, 0x83,   3},
	{0x84, 0x84,   4}, {0x85, 0x85,   5}, {0x86, 0x86,   6}, {0x87, 0x87,   7},
	{0x88, 0x88,   8}, {0x89, 0x89,   9}, {0x8A, 0x8A,  10}, {0x8B, 0x8B,  11},
	{0x8C, 0x8C,  12}, {0x8D, 0x8D,  13}, {0x8E, 0x8E,  14}, {0x8F, 0x8F,  15},
	{0x90, 0x90,  16}, {0x91, 0x91,  17}, {0x92, 0x92,  18}, {0x93, 0x93,  19},
	{0x94, 0x94,  20}, {0x95, 0x95,  21}, {0x96, 0x96,  22}, {0x97, 0x97,  23},
	{0x98, 0x98,  24}, {0x99, 0x99,  25}, {0x9A, 0x9A,  26}, {0x9B, 0x9B,  27},
	{0x9C, 0x9C,  28}, {0x9D, 0x9D,  29}, {0x9E, 0x9E,  30}, {0x9F, 0x9F,  31},
	{NBSP, 0xA0,  32}, {L'¡', 0xA1,  33}, {L'¢', 0xA2,  34}, {L'£', 0xA3,  35},
	{L'¤', 0xA4,  36}, {L'¥', 0xA5,  37}, {L'¦', 0xA6,  38}, {L'§', 0xA7,  39},
	{L'¨', 0xA8,  40}, {L'©', 0xA9,  41}, {L'ª', 0xAA,  42}, {L'«', 0xAB,  43},
	{L'¬', 0xAC,  44}, {SFHY, 0xAD,  45}, {L'®', 0xAE,  46}, {L'¯', 0xAF,  47},
	{L'°', 0xB0,  48}, {L'±', 0xB1,  49}, {L'²', 0xB2,  50}, {L'³', 0xB3,  51},
	{L'´', 0xB4,  52}, {L'µ', 0xB5,  53}, {L'¶', 0xB6,  54}, {L'·', 0xB7,  55},
	{L'¸', 0xB8,  56}, {L'¹', 0xB9,  57}, {L'º', 0xBA,  58}, {L'»', 0xBB,  59},
	{L'¼', 0xBC,  60}, {L'½', 0xBD,  61}, {L'¾', 0xBE,  62}, {L'¿', 0xBF,  63},
	{L'À', 0xC0,  64}, {L'Á', 0xC1,  65}, {L'Â', 0xC2,  66}, {L'Ã', 0xC3,  67},
	{L'Ä', 0xC4,  68}, {L'Å', 0xC5,  69}, {L'Æ', 0xC6,  70}, {L'Ç', 0xC7,  71},
	{L'È', 0xC8,  72}, {L'É', 0xC9,  73}, {L'Ê', 0xCA,  74}, {L'Ë', 0xCB,  75},
	{L'Ì', 0xCC,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'Ï', 0xCF,  79},
	{L'Ð', 0xD0,  80}, {L'Ñ', 0xD1,  81}, {L'Ò', 0xD2,  82}, {L'Ó', 0xD3,  83},
	{L'Ô', 0xD4,  84}, {L'Õ', 0xD5,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'Ø', 0xD8,  88}, {L'Ù', 0xD9,  89}, {L'Ú', 0xDA,  90}, {L'Û', 0xDB,  91},
	{L'Ü', 0xDC,  92}, {L'Ý', 0xDD,  93}, {L'Þ', 0xDE,  94}, {L'ß', 0xDF,  95},
	{L'à', 0xE0,  96}, {L'á', 0xE1,  97}, {L'â', 0xE2,  98}, {L'ã', 0xE3,  99},
	{L'ä', 0xE4, 100}, {L'å', 0xE5, 101}, {L'æ', 0xE6, 102}, {L'ç', 0xE7, 103},
	{L'è', 0xE8, 104}, {L'é', 0xE9, 105}, {L'ê', 0xEA, 106}, {L'ë', 0xEB, 107},
	{L'ì', 0xEC, 108}, {L'í', 0xED, 109}, {L'î', 0xEE, 110}, {L'ï', 0xEF, 111},
	{L'ð', 0xF0, 112}, {L'ñ', 0xF1, 113}, {L'ò', 0xF2, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'õ', 0xF5, 117}, {L'ö', 0xF6, 118}, {L'÷', 0xF7, 119},
	{L'ø', 0xF8, 120}, {L'ù', 0xF9, 121}, {L'ú', 0xFA, 122}, {L'û', 0xFB, 123},
	{L'ü', 0xFC, 124}, {L'ý', 0xFD, 125}, {L'þ', 0xFE, 126}, {L'ÿ', 0xFF, 127}
};

struct hash_table const unicode_latin2_array[] =
{
	{0x80, 0x80,   0}, {0x81, 0x81,   1}, {0x82, 0x82,  54}, {0x83, 0x83,  76},
	{0x84, 0x84,  33}, {0x85, 0x85,  41}, {0x86, 0x86,  55}, {0x87, 0x87,  81},
	{0x88, 0x88,   8}, {0x89, 0x89,   9}, {0x8A, 0x8A,  10}, {0x8B, 0x8B,  11},
	{0x8C, 0x8C,  58}, {0x8D, 0x8D,  82}, {0x8E, 0x8E,  63}, {0x8F, 0x8F, 102},
	{0x90, 0x90,  64}, {0x91, 0x91, 104}, {0x92, 0x92,  18}, {0x93, 0x93,  19},
	{0x94, 0x94,  20}, {0x95, 0x95,  21}, {0x96, 0x96,  22}, {0x97, 0x97,  23},
	{0x98, 0x98,  59}, {0x99, 0x99,  89}, {0x9A, 0x9A,  60}, {0x9B, 0x9B,  99},
	{0x9C, 0x9C,  28}, {0x9D, 0x9D,  29}, {0x9E, 0x9E,  30}, {0x9F, 0x9F,  31},
	{NBSP, 0xA0,  32}, {L'Ą', 0xA1,  33}, {L'Ł', 0xA3,  34}, {L'Ś', 0xA6,  35},
	{L'¤', 0xA4,  36}, {L'Ť', 0xAB,  37}, {L'Ž', 0xAE,  38}, {L'§', 0xA7,  39},
	{L'¨', 0xA8,  40}, {L'ą', 0xB1,  41}, {L'ł', 0xB3,  42}, {L'ś', 0xB6,  43},
	{L'ˇ', 0xB7,  69}, {SFHY, 0xAD,  45}, {L'š', 0xB9,  46}, {L'ş', 0xBA,  47},
	{L'°', 0xB0,  48}, {L'ź', 0xBC,  49}, {L'˝', 0xBD,  50}, {L'ż', 0xBF,  51},
	{L'´', 0xB4,  52}, {L'Ŕ', 0xC0,  53}, {L'Ă', 0xC3,  54}, {L'Ć', 0xC6,  55},
	{L'¸', 0xB8,  56}, {L'Ĺ', 0xC5,  57}, {L'Č', 0xC8,  79}, {L'Ę', 0xCA,  59},
	{L'Ě', 0xCC,  60}, {L'Ľ', 0xA5,  61}, {L'ľ', 0xB5,  62}, {L'Ď', 0xCF,  63},
	{L'Đ', 0xD0,  64}, {L'Á', 0xC1,  34}, {L'Â', 0xC2,  42}, {L'Ń', 0xD1,  67},
	{L'Ä', 0xC4, 106}, {L'Ň', 0xD2,  69}, {L'Ř', 0xD8,  70}, {L'Ç', 0xC7,  44},
	{L'Ů', 0xD9, 108}, {L'É', 0xC9,  73}, {L'Ţ', 0xDE,  74}, {L'Ë', 0xCB,  75},
	{L'ă', 0xE3,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'ĺ', 0xE5,  79},
	{L'Ő', 0xD5,  80}, {L'ć', 0xE6, 111}, {L'č', 0xE8,  82}, {L'Ó', 0xD3,  83},
	{L'Ô', 0xD4,  53}, {L'ŕ', 0xE0,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'˘', 0xA2,  70}, {L'ę', 0xEA, 113}, {L'Ú', 0xDA,  35}, {L'˛', 0xB2,  43},
	{L'Ü', 0xDC,  92}, {L'Ý', 0xDD,  50}, {L'Ş', 0xAA,  94}, {L'ß', 0xDF,  47},
	{L'Š', 0xA9,  96}, {L'á', 0xE1,  46}, {L'â', 0xE2,  74}, {L'ě', 0xEC, 120},
	{L'ä', 0xE4,  37}, {L'ť', 0xBB, 101}, {L'ď', 0xEF, 102}, {L'ç', 0xE7, 103},
	{L'đ', 0xF0, 104}, {L'é', 0xE9, 105}, {L'ń', 0xF1, 106}, {L'ë', 0xEB, 107},
	{L'ň', 0xF2, 108}, {L'í', 0xED, 109}, {L'î', 0xEE,  72}, {L'ő', 0xF5, 114},
	{L'Ű', 0xDB, 112}, {L'ř', 0xF8, 117}, {L'ů', 0xF9, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'ű', 0xFB, 127}, {L'ö', 0xF6, 118}, {L'÷', 0xF7, 119},
	{L'ţ', 0xFE, 120}, {L'Ź', 0xAC, 121}, {L'ú', 0xFA,  49}, {L'Ż', 0xAF, 123},
	{L'ü', 0xFC,  51}, {L'ý', 0xFD,  38}, {L'ž', 0xBE, 126}, {L'˙', 0xFF, 127}
};

struct hash_table const unicode_latin3_array[] =
{
	{0x80, 0x80,   0}, {0x81, 0x81,   1}, {0x82, 0x82,   2}, {0x83, 0x83,   3},
	{0x84, 0x84,   4}, {0x85, 0x85,   5}, {0x86, 0x86,   6}, {0x87, 0x87,   7},
	{0x88, 0x88,  62}, {0x89, 0x89,  99}, {0x8A, 0x8A,  60}, {0x8B, 0x8B,  93},
	{0x8C, 0x8C,  12}, {0x8D, 0x8D,  13}, {0x8E, 0x8E,  14}, {0x8F, 0x8F,  15},
	{0x90, 0x90,  16}, {0x91, 0x91,  17}, {0x92, 0x92,  18}, {0x93, 0x93,  19},
	{0x94, 0x94,  20}, {0x95, 0x95,  21}, {0x96, 0x96,  22}, {0x97, 0x97,  23},
	{0x98, 0x98,  24}, {0x99, 0x99,  25}, {0x9A, 0x9A,  26}, {0x9B, 0x9B,  27},
	{0x9C, 0x9C,  69}, {0x9D, 0x9D, 112}, {0x9E, 0x9E,  37}, {0x9F, 0x9F,  54},
	{NBSP, 0xA0,  67}, {L'Ĥ', 0xA6, 102}, {L'İ', 0xA9,  34}, {L'£', 0xA3,  35},
	{L'¤', 0xA4,  33}, {L'Ğ', 0xAB,  46}, {L'Ħ', 0xA1,  38}, {L'§', 0xA7,  44},
	{L'¨', 0xA8,  40}, {L'Ĵ', 0xAC,  41}, {L'', 0xAE,  42}, {L'Ż', 0xAF, 101},
	{L'ħ', 0xB1,  44}, {SFHY, 0xAD,  45}, {L'ĥ', 0xB6,  46}, {L'ş', 0xBA,  47},
	{L'°', 0xB0,  34}, {L'ı', 0xB9,  49}, {L'²', 0xB2,  50}, {L'³', 0xB3,  51},
	{L'´', 0xB4,  41}, {L'µ', 0xB5,  57}, {L'ğ', 0xBB,  54}, {L'·', 0xB7,  55},
	{L'¸', 0xB8,  56}, {L'ĵ', 0xBC,  57}, {L'', 0xBE,  58}, {L'ż', 0xBF,  59},
	{L'Ċ', 0xC5,  60}, {L'½', 0xBD,  61}, {L'Ĉ', 0xC6,  62}, {L'', 0xD0,  63},
	{L'À', 0xC0,  64}, {L'Á', 0xC1,  65}, {L'Â', 0xC2,  66}, {L'Ġ', 0xD5,  67},
	{L'Ä', 0xC4,  68}, {L'Ĝ', 0xD8,  69}, {L'Ŭ', 0xDD,  70}, {L'Ç', 0xC7,  71},
	{L'È', 0xC8,  72}, {L'É', 0xC9,  73}, {L'Ê', 0xCA,  74}, {L'Ë', 0xCB,  75},
	{L'Ì', 0xCC,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'Ï', 0xCF,  79},
	{L'Ŝ', 0xDE,  80}, {L'Ñ', 0xD1,  81}, {L'Ò', 0xD2,  82}, {L'Ó', 0xD3,  83},
	{L'Ô', 0xD4,  84}, {L'', 0xE3,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'˘', 0xA2,  88}, {L'Ù', 0xD9, 127}, {L'Ú', 0xDA,  90}, {L'Û', 0xDB,  91},
	{L'Ü', 0xDC,  80}, {L'ċ', 0xE5, 126}, {L'Ş', 0xAA,  94}, {L'ß', 0xDF,  47},
	{L'à', 0xE0,  96}, {L'á', 0xE1,  97}, {L'â', 0xE2,  98}, {L'ĉ', 0xE6,  99},
	{L'ä', 0xE4, 100}, {L'', 0xF0, 101}, {L'ġ', 0xF5, 102}, {L'ç', 0xE7, 103},
	{L'è', 0xE8, 104}, {L'é', 0xE9, 105}, {L'ê', 0xEA, 106}, {L'ë', 0xEB, 107},
	{L'ì', 0xEC,  70}, {L'í', 0xED, 125}, {L'î', 0xEE, 110}, {L'ï', 0xEF, 111},
	{L'ĝ', 0xF8, 112}, {L'ñ', 0xF1, 113}, {L'ò', 0xF2, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'', 0xA5, 117}, {L'ö', 0xF6,  42}, {L'÷', 0xF7,  58},
	{L'', 0xC3, 120}, {L'ù', 0xF9,  63}, {L'ú', 0xFA,  85}, {L'û', 0xFB,  43},
	{L'ü', 0xFC,  59}, {L'ŭ', 0xFD, 125}, {L'ŝ', 0xFE, 126}, {L'˙', 0xFF, 127}
};

struct hash_table const unicode_greek_array[] =
{
	{0x80, 0x80,   0}, {0x81, 0x81,   1}, {0x82, 0x82,   2}, {0x83, 0x83,   3},
	{0x84, 0x84,  36}, {0x85, 0x85,  37}, {0x86, 0x86,  42}, {0x87, 0x87,   7},
	{0x88, 0x88,  46}, {0x89, 0x89,  47}, {0x8A, 0x8A,  52}, {0x8B, 0x8B,  11},
	{0x8C, 0x8C,  53}, {0x8D, 0x8D,  13}, {0x8E, 0x8E,  54}, {0x8F, 0x8F,  56},
	{0x90, 0x90,  57}, {0x91, 0x91,  58}, {0x92, 0x92,  62}, {0x93, 0x93,  63},
	{0x94, 0x94,  64}, {0x95, 0x95,  34}, {0x96, 0x96,  70}, {0x97, 0x97,  71},
	{0x98, 0x98,  72}, {0x99, 0x99,  73}, {0x9A, 0x9A,  74}, {0x9B, 0x9B,  75},
	{0x9C, 0x9C,  76}, {0x9D, 0x9D,  77}, {0x9E, 0x9E,  78}, {0x9F, 0x9F,  79},
	{NBSP, 0xA0,  80}, {L'ʽ', 0xA1,  81}, {L'―', 0xAF,  65}, {L'£', 0xA3,  83},
	{L'΄', 0xB4,  84}, {L'΅', 0xB5,  85}, {L'¦', 0xA6,  86}, {L'§', 0xA7,  87},
	{L'¨', 0xA8,  88}, {L'©', 0xA9,  89}, {L'Ά', 0xB6,  90}, {L'«', 0xAB,  91},
	{L'¬', 0xAC,  92}, {SFHY, 0xAD,  93}, {L'Έ', 0xB8,  94}, {L'Ή', 0xB9,  95},
	{L'°', 0xB0,  96}, {L'±', 0xB1,  97}, {L'²', 0xB2,  98}, {L'³', 0xB3,  99},
	{L'Ί', 0xBA, 100}, {L'Ό', 0xBC, 101}, {L'Ύ', 0xBE, 102}, {L'·', 0xB7, 103},
	{L'Ώ', 0xBF, 104}, {L'ΐ', 0xC0, 105}, {L'Α', 0xC1, 106}, {L'»', 0xBB, 107},
	{L'ʼ', 0xA2, 108}, {L'½', 0xBD,  33}, {L'Β', 0xC2, 110}, {L'Γ', 0xC3, 111},
	{L'Δ', 0xC4, 112}, {L'Ε', 0xC5, 113}, {L'', 0xA4, 114}, {L'', 0xA5, 115},
	{L'', 0xAA, 116}, {L'', 0xAE, 117}, {L'Ζ', 0xC6,  82}, {L'Η', 0xC7, 119},
	{L'Θ', 0xC8, 120}, {L'Ι', 0xC9, 121}, {L'Κ', 0xCA, 122}, {L'Λ', 0xCB, 123},
	{L'Μ', 0xCC, 124}, {L'Ν', 0xCD, 125}, {L'Ξ', 0xCE, 126}, {L'Ο', 0xCF,  79},
	{L'Π', 0xD0,  80}, {L'Ρ', 0xD1, 109}, {L'', 0xD2, 118}, {L'Σ', 0xD3,  83},
	{L'Τ', 0xD4,  84}, {L'Υ', 0xD5,  85}, {L'Φ', 0xD6,  86}, {L'Χ', 0xD7,  87},
	{L'Ψ', 0xD8,  88}, {L'Ω', 0xD9,  89}, {L'Ϊ', 0xDA,  90}, {L'Ϋ', 0xDB,  91},
	{L'ά', 0xDC,  92}, {L'έ', 0xDD,  93}, {L'ή', 0xDE,  94}, {L'ί', 0xDF,  95},
	{L'ΰ', 0xE0,  96}, {L'α', 0xE1,  97}, {L'β', 0xE2,  98}, {L'γ', 0xE3,  99},
	{L'δ', 0xE4, 100}, {L'ε', 0xE5, 101}, {L'ζ', 0xE6, 102}, {L'η', 0xE7, 103},
	{L'θ', 0xE8, 104}, {L'ι', 0xE9, 105}, {L'κ', 0xEA, 106}, {L'λ', 0xEB, 107},
	{L'μ', 0xEC, 108}, {L'ν', 0xED, 109}, {L'ξ', 0xEE, 110}, {L'ο', 0xEF, 111},
	{L'π', 0xF0, 112}, {L'ρ', 0xF1, 113}, {L'ς', 0xF2, 114}, {L'σ', 0xF3, 115},
	{L'τ', 0xF4, 116}, {L'υ', 0xF5, 117}, {L'φ', 0xF6, 118}, {L'χ', 0xF7, 127},
	{L'ψ', 0xF8, 120}, {L'ω', 0xF9, 121}, {L'ϊ', 0xFA, 122}, {L'ϋ', 0xFB, 123},
	{L'ό', 0xFC, 124}, {L'ύ', 0xFD, 125}, {L'ώ', 0xFE, 126}, {L'', 0xFF, 127}
};

struct hash_table const unicode_latin6_array[] =
{
	{0x80, 0x80,  58}, {0x81, 0x81,  72}, {0x82, 0x82,   2}, {0x83, 0x83,   3},
	{0x84, 0x84,  33}, {0x85, 0x85,  41}, {0x86, 0x86,   6}, {0x87, 0x87,   7},
	{0x88, 0x88,   8}, {0x89, 0x89,   9}, {0x8A, 0x8A,  10}, {0x8B, 0x8B,  11},
	{0x8C, 0x8C,  62}, {0x8D, 0x8D,  82}, {0x8E, 0x8E,  14}, {0x8F, 0x8F,  15},
	{0x90, 0x90,  36}, {0x91, 0x91,  50}, {0x92, 0x92,  34}, {0x93, 0x93,  43},
	{0x94, 0x94,  20}, {0x95, 0x95,  53}, {0x96, 0x96,  64}, {0x97, 0x97,  89},
	{0x98, 0x98,  63}, {0x99, 0x99,  87}, {0x9A, 0x9A,  26}, {0x9B, 0x9B,  27},
	{0x9C, 0x9C,  28}, {0x9D, 0x9D,  29}, {0x9E, 0x9E,  30}, {0x9F, 0x9F,  31},
	{NBSP, 0xA0,  32}, {L'Ą', 0xA1,  33}, {L'Ē', 0xA2,  35}, {L'Ģ', 0xA3,  44},
	{L'Đ', 0xA9,  36}, {L'Ŧ', 0xAB,  37}, {L'Ž', 0xAC,  38}, {L'§', 0xA7,  39},
	{L'Ĩ', 0xA5,  40}, {L'ą', 0xB1,  47}, {L'Ī', 0xA4,  42}, {L'ē', 0xB2,  46},
	{L'ģ', 0xB3,  44}, {SFHY, 0xAD,  45}, {L'ī', 0xB4,  61}, {L'ĩ', 0xB5,  81},
	{L'°', 0xB0,  48}, {L'ķ', 0xB6,  49}, {L'đ', 0xB9,  50}, {L'š', 0xBA,  51},
	{L'ž', 0xBC,  52}, {L'―', 0xBD,  53}, {L'Ķ', 0xA6,  54}, {L'·', 0xB7,  49},
	{L'ū', 0xBE, 127}, {L'ŋ', 0xBF,  57}, {L'Ā', 0xC0,  58}, {L'Ļ', 0xA8,  59},
	{L'ļ', 0xB8,  60}, {L'Į', 0xC7,  61}, {L'Č', 0xC8,  62}, {L'Ę', 0xCA,  63},
	{L'Ė', 0xCC,  64}, {L'Á', 0xC1,  65}, {L'Â', 0xC2,  66}, {L'Ã', 0xC3,  67},
	{L'Ä', 0xC4,  68}, {L'Å', 0xC5,  71}, {L'Æ', 0xC6, 108}, {L'Ņ', 0xD1,  71},
	{L'ā', 0xE0,  72}, {L'É', 0xC9,  73}, {L'Ŋ', 0xAF,  74}, {L'Ë', 0xCB,  57},
	{L'Ō', 0xD2,  76}, {L'Í', 0xCD, 113}, {L'Î', 0xCE,  78}, {L'Ï', 0xCF,  79},
	{L'Ð', 0xD0,  80}, {L'į', 0xE7,  81}, {L'č', 0xE8,  82}, {L'Ó', 0xD3,  83},
	{L'Ô', 0xD4,  84}, {L'Õ', 0xD5,  85}, {L'Ö', 0xD6,  86}, {L'ę', 0xEA,  87},
	{L'Ø', 0xD8,  88}, {L'ė', 0xEC,  89}, {L'Ú', 0xDA,  90}, {L'Û', 0xDB,  91},
	{L'Ü', 0xDC,  92}, {L'Ý', 0xDD,  93}, {L'Þ', 0xDE,  94}, {L'ß', 0xDF,  95},
	{L'Š', 0xAA,  96}, {L'á', 0xE1,  51}, {L'â', 0xE2,  98}, {L'ã', 0xE3,  99},
	{L'ä', 0xE4, 100}, {L'å', 0xE5, 101}, {L'æ', 0xE6,  37}, {L'ŧ', 0xBB, 103},
	{L'Ũ', 0xD7, 104}, {L'é', 0xE9, 119}, {L'Ū', 0xAE, 106}, {L'ë', 0xEB,  56},
	{L'ņ', 0xF1, 108}, {L'í', 0xED, 109}, {L'î', 0xEE, 110}, {L'ï', 0xEF, 111},
	{L'ð', 0xF0, 112}, {L'ō', 0xF2, 113}, {L'Ų', 0xD9, 114}, {L'ó', 0xF3, 121},
	{L'ô', 0xF4, 116}, {L'õ', 0xF5, 117}, {L'ö', 0xF6, 118}, {L'ũ', 0xF7, 119},
	{L'ø', 0xF8, 120}, {L'ų', 0xF9, 121}, {L'ú', 0xFA, 122}, {L'û', 0xFB, 123},
	{L'ü', 0xFC, 124}, {L'ý', 0xFD,  38}, {L'þ', 0xFE,  52}, {L'ĸ', 0xFF, 127}
};

struct hash_table const unicode_latin9_array[] =
{
	{0x80, 0x80,   0}, {0x81, 0x81,   1}, {0x82, 0x82,   2}, {0x83, 0x83,   3},
	{0x84, 0x84,   4}, {0x85, 0x85,   5}, {0x86, 0x86,   6}, {0x87, 0x87,   7},
	{0x88, 0x88,   8}, {0x89, 0x89,   9}, {0x8A, 0x8A,  10}, {0x8B, 0x8B,  11},
	{0x8C, 0x8C,  12}, {0x8D, 0x8D,  13}, {0x8E, 0x8E,  14}, {0x8F, 0x8F,  15},
	{0x90, 0x90,  16}, {0x91, 0x91,  17}, {0x92, 0x92,  18}, {0x93, 0x93,  19},
	{0x94, 0x94,  20}, {0x95, 0x95,  21}, {0x96, 0x96,  22}, {0x97, 0x97,  23},
	{0x98, 0x98,  24}, {0x99, 0x99,  25}, {0x9A, 0x9A,  26}, {0x9B, 0x9B,  27},
	{0x9C, 0x9C,  28}, {0x9D, 0x9D,  29}, {0x9E, 0x9E,  30}, {0x9F, 0x9F,  31},
	{NBSP, 0xA0,  32}, {L'¡', 0xA1,  33}, {L'¢', 0xA2,  34}, {L'£', 0xA3,  35},
	{L'€', 0xA4,  36}, {L'¥', 0xA5,  37}, {L'Š', 0xA6,  38}, {L'§', 0xA7,  39},
	{L'š', 0xA8,  40}, {L'©', 0xA9,  41}, {L'ª', 0xAA,  42}, {L'«', 0xAB,  43},
	{L'¬', 0xAC,  36}, {SFHY, 0xAD,  45}, {L'®', 0xAE,  46}, {L'¯', 0xAF,  47},
	{L'°', 0xB0,  48}, {L'±', 0xB1,  49}, {L'²', 0xB2,  50}, {L'³', 0xB3,  51},
	{L'Ž', 0xB4,  52}, {L'µ', 0xB5,  53}, {L'¶', 0xB6,  54}, {L'·', 0xB7,  55},
	{L'ž', 0xB8,  56}, {L'¹', 0xB9,  57}, {L'º', 0xBA,  58}, {L'»', 0xBB,  59},
	{L'Œ', 0xBC,  60}, {L'œ', 0xBD,  61}, {L'Ÿ', 0xBE,  62}, {L'¿', 0xBF,  63},
	{L'À', 0xC0,  64}, {L'Á', 0xC1,  65}, {L'Â', 0xC2,  66}, {L'Ã', 0xC3,  67},
	{L'Ä', 0xC4,  68}, {L'Å', 0xC5,  69}, {L'Æ', 0xC6,  70}, {L'Ç', 0xC7,  71},
	{L'È', 0xC8,  72}, {L'É', 0xC9,  73}, {L'Ê', 0xCA,  74}, {L'Ë', 0xCB,  75},
	{L'Ì', 0xCC,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'Ï', 0xCF,  79},
	{L'Ð', 0xD0,  80}, {L'Ñ', 0xD1,  81}, {L'Ò', 0xD2,  60}, {L'Ó', 0xD3,  61},
	{L'Ô', 0xD4,  84}, {L'Õ', 0xD5,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'Ø', 0xD8,  88}, {L'Ù', 0xD9,  89}, {L'Ú', 0xDA,  90}, {L'Û', 0xDB,  91},
	{L'Ü', 0xDC,  92}, {L'Ý', 0xDD,  93}, {L'Þ', 0xDE,  94}, {L'ß', 0xDF,  95},
	{L'à', 0xE0,  38}, {L'á', 0xE1,  40}, {L'â', 0xE2,  98}, {L'ã', 0xE3,  99},
	{L'ä', 0xE4, 100}, {L'å', 0xE5, 101}, {L'æ', 0xE6, 102}, {L'ç', 0xE7, 103},
	{L'è', 0xE8, 104}, {L'é', 0xE9, 105}, {L'ê', 0xEA, 106}, {L'ë', 0xEB, 107},
	{L'ì', 0xEC, 108}, {L'í', 0xED, 109}, {L'î', 0xEE, 110}, {L'ï', 0xEF, 111},
	{L'ð', 0xF0, 112}, {L'ñ', 0xF1, 113}, {L'ò', 0xF2, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'õ', 0xF5, 117}, {L'ö', 0xF6, 118}, {L'÷', 0xF7, 119},
	{L'ø', 0xF8,  62}, {L'ù', 0xF9, 121}, {L'ú', 0xFA, 122}, {L'û', 0xFB, 123},
	{L'ü', 0xFC, 124}, {L'ý', 0xFD,  52}, {L'þ', 0xFE,  56}, {L'ÿ', 0xFF, 127}
};

struct hash_table const unicode_win1252_array[] =
{
	{L'€', 0x80,   0}, {0x81, 0x81,   1}, {L'…', 0x85,   2}, {L'†', 0x86,   3},
	{L'‡', 0x87,   4}, {L'ˆ', 0x88,   5}, {L'‰', 0x89,   6}, {L'Š', 0x8A,   7},
	{L'‹', 0x8B,   8}, {L'Œ', 0x8C,   9}, {L'Ž', 0x8E,  10}, {L'”', 0x94,  11},
	{L'•', 0x95,  17}, {0x8D, 0x8D,  13}, {L'˜', 0x98,  14}, {0x8F, 0x8F,  15},
	{0x90, 0x90,  16}, {L'™', 0x99,  17}, {L'ƒ', 0x83,  18}, {L'–', 0x96,  19},
	{L'—', 0x97,  20}, {L'š', 0x9A,  21}, {L'›', 0x9B,  22}, {L'œ', 0x9C,  23},
	{L'‘', 0x91,  24}, {L'’', 0x92,  25}, {L'‚', 0x82,  26}, {L'ž', 0x9E,  27},
	{L'“', 0x93,  28}, {0x9D, 0x9D,  11}, {L'„', 0x84,  30}, {L'Ÿ', 0x9F,  31},
	{NBSP, 0xA0,   3}, {L'¡', 0xA1,   4}, {L'¢', 0xA2,  12}, {L'£', 0xA3,  35},
	{L'¤', 0xA4,  36}, {L'¥', 0xA5,  37}, {L'¦', 0xA6,   2}, {L'§', 0xA7,  39},
	{L'¨', 0xA8,  40}, {L'©', 0xA9,  41}, {L'ª', 0xAA,  42}, {L'«', 0xAB,  43},
	{L'¬', 0xAC,   0}, {SFHY, 0xAD,  45}, {L'®', 0xAE,  46}, {L'¯', 0xAF,  47},
	{L'°', 0xB0,   6}, {L'±', 0xB1,  49}, {L'²', 0xB2,  50}, {L'³', 0xB3,  51},
	{L'´', 0xB4,  52}, {L'µ', 0xB5,  53}, {L'¶', 0xB6,  54}, {L'·', 0xB7,  55},
	{L'¸', 0xB8,  56}, {L'¹', 0xB9,   8}, {L'º', 0xBA,  22}, {L'»', 0xBB,  59},
	{L'¼', 0xBC,  60}, {L'½', 0xBD,  61}, {L'¾', 0xBE,  62}, {L'¿', 0xBF,  63},
	{L'À', 0xC0,  64}, {L'Á', 0xC1,  65}, {L'Â', 0xC2,  66}, {L'Ã', 0xC3,  67},
	{L'Ä', 0xC4,  68}, {L'Å', 0xC5,  69}, {L'Æ', 0xC6,   5}, {L'Ç', 0xC7,  71},
	{L'È', 0xC8,  72}, {L'É', 0xC9,  73}, {L'Ê', 0xCA,  74}, {L'Ë', 0xCB,  75},
	{L'Ì', 0xCC,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'Ï', 0xCF,  79},
	{L'Ð', 0xD0,  80}, {L'Ñ', 0xD1,  81}, {L'Ò', 0xD2,   9}, {L'Ó', 0xD3,  23},
	{L'Ô', 0xD4,  84}, {L'Õ', 0xD5,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'Ø', 0xD8,  88}, {L'Ù', 0xD9,  89}, {L'Ú', 0xDA,  90}, {L'Û', 0xDB,  91},
	{L'Ü', 0xDC,  14}, {L'Ý', 0xDD,  93}, {L'Þ', 0xDE,  94}, {L'ß', 0xDF,  95},
	{L'à', 0xE0,   7}, {L'á', 0xE1,  21}, {L'â', 0xE2,  98}, {L'ã', 0xE3,  99},
	{L'ä', 0xE4, 100}, {L'å', 0xE5, 101}, {L'æ', 0xE6, 102}, {L'ç', 0xE7, 103},
	{L'è', 0xE8, 104}, {L'é', 0xE9, 105}, {L'ê', 0xEA, 106}, {L'ë', 0xEB, 107},
	{L'ì', 0xEC, 108}, {L'í', 0xED, 109}, {L'î', 0xEE, 110}, {L'ï', 0xEF, 111},
	{L'ð', 0xF0, 112}, {L'ñ', 0xF1, 113}, {L'ò', 0xF2, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'õ', 0xF5, 117}, {L'ö', 0xF6, 118}, {L'÷', 0xF7, 119},
	{L'ø', 0xF8,  31}, {L'ù', 0xF9, 121}, {L'ú', 0xFA, 122}, {L'û', 0xFB, 123},
	{L'ü', 0xFC, 124}, {L'ý', 0xFD,  10}, {L'þ', 0xFE,  27}, {L'ÿ', 0xFF, 127}
};

struct hash_table const unicode_win1250_array[] =
{
	{L'€', 0x80,   0}, {0x81, 0x81,   1}, {L'…', 0x85,  37}, {0x83, 0x83,  76},
	{L'†', 0x86,  17}, {L'‰', 0x89,  22}, {L'Ś', 0x8C,  47}, {L'Ť', 0x8D,  81},
	{0x88, 0x88,   8}, {L'Ž', 0x8E,   9}, {L'‘', 0x91,  51}, {L'™', 0x99,  11},
	{L'š', 0x9A,  50}, {L'ź', 0x9F,  82}, {L'ˇ', 0xA1,  63}, {L'Ł', 0xA3, 102},
	{0x90, 0x90,  64}, {L'Ą', 0xA5, 104}, {L'˛', 0xB2,  18}, {L'–', 0x96,  19},
	{L'—', 0x97,  20}, {L'ł', 0xB3,  21}, {L'ą', 0xB9,  22}, {L'ş', 0xBA,  23},
	{0x98, 0x98,  10}, {L'’', 0x92,  89}, {L'‚', 0x82,  60}, {L'˝', 0xBD,  99},
	{L'“', 0x93,  28}, {L'”', 0x94,  29}, {L'„', 0x84,  30}, {L'ż', 0xBF,  31},
	{NBSP, 0xA0,   4}, {L'‡', 0x87,  33}, {L'•', 0x95,  11}, {L'Ŕ', 0xC0,  35},
	{L'¤', 0xA4,  36}, {L'Ă', 0xC3,  37}, {L'¦', 0xA6,   2}, {L'§', 0xA7,  39},
	{L'¨', 0xA8,  40}, {L'©', 0xA9,  41}, {L'Ĺ', 0xC5,  42}, {L'«', 0xAB,  43},
	{L'¬', 0xAC,   0}, {SFHY, 0xAD,  45}, {L'®', 0xAE,  46}, {L'Ć', 0xC6,  47},
	{L'°', 0xB0,   5}, {L'±', 0xB1,  49}, {L'Č', 0xC8,  50}, {L'Ę', 0xCA,  51},
	{L'´', 0xB4,  52}, {L'µ', 0xB5,  53}, {L'¶', 0xB6,  54}, {L'·', 0xB7,  55},
	{L'¸', 0xB8,  56}, {L'‹', 0x8B,  42}, {L'›', 0x9B,  79}, {L'»', 0xBB,  59},
	{L'Ě', 0xCC,  60}, {L'Ľ', 0xBC,  61}, {L'ľ', 0xBE,  62}, {L'Ď', 0xCF,  69},
	{L'Đ', 0xD0,  64}, {L'Á', 0xC1,  15}, {L'Â', 0xC2,  21}, {L'Ń', 0xD1,  67},
	{L'Ä', 0xC4, 106}, {L'Ň', 0xD2,  69}, {L'Ř', 0xD8,  70}, {L'Ç', 0xC7,  14},
	{L'Ů', 0xD9, 108}, {L'É', 0xC9,  73}, {L'Ţ', 0xDE,  74}, {L'Ë', 0xCB,  75},
	{L'ă', 0xE3,  76}, {L'Í', 0xCD,  77}, {L'Î', 0xCE,  78}, {L'ĺ', 0xE5,  79},
	{L'Ő', 0xD5,  80}, {L'ć', 0xE6, 111}, {L'č', 0xE8,  82}, {L'Ó', 0xD3,  83},
	{L'Ô', 0xD4,  35}, {L'ŕ', 0xE0,  85}, {L'Ö', 0xD6,  86}, {L'×', 0xD7,  87},
	{L'˘', 0xA2,  70}, {L'ę', 0xEA, 113}, {L'Ú', 0xDA,   6}, {L'ś', 0x9C,  18},
	{L'Ü', 0xDC,  92}, {L'Ý', 0xDD,  27}, {L'Ş', 0xAA,  94}, {L'ß', 0xDF,  23},
	{L'Š', 0x8A,  96}, {L'á', 0xE1,  12}, {L'â', 0xE2,  74}, {L'ě', 0xEC, 120},
	{L'ä', 0xE4,   7}, {L'ť', 0x9D, 101}, {L'ď', 0xEF, 102}, {L'ç', 0xE7, 103},
	{L'đ', 0xF0, 104}, {L'é', 0xE9, 105}, {L'ń', 0xF1, 106}, {L'ë', 0xEB, 107},
	{L'ň', 0xF2, 108}, {L'í', 0xED, 109}, {L'î', 0xEE,  72}, {L'ő', 0xF5, 114},
	{L'Ű', 0xDB, 112}, {L'ř', 0xF8, 117}, {L'ů', 0xF9, 114}, {L'ó', 0xF3, 115},
	{L'ô', 0xF4, 116}, {L'ű', 0xFB, 127}, {L'ö', 0xF6, 118}, {L'÷', 0xF7, 119},
	{L'ţ', 0xFE, 120}, {L'Ź', 0x8F, 121}, {L'ú', 0xFA,  13}, {L'Ż', 0xAF, 123},
	{L'ü', 0xFC,  31}, {L'ý', 0xFD,   9}, {L'ž', 0x9E, 126}, {L'˙', 0xFF, 127}
};

struct hash_table const unicode_win1253_array[] =
{
	{L'€', 0x80,  90}, {0x81, 0x81,   1}, {L'‚', 0x82,  73}, {L'„', 0x84,  77},
	{L'…', 0x85,  27}, {L'†', 0x86,  21}, {L'‰', 0x89,  22}, {L'‘', 0x91,  71},
	{0x88, 0x88,  42}, {L'“', 0x93,  47}, {0x8A, 0x8A,  52}, {L'”', 0x94,  76},
	{0x8C, 0x8C,  56}, {0x8D, 0x8D,  13}, {0x8E, 0x8E,  60}, {0x8F, 0x8F,  62},
	{0x90, 0x90,  63}, {L'™', 0x99,  64}, {L'ƒ', 0x83,  65}, {L'–', 0x96,  66},
	{L'—', 0x97,  67}, {L'΅', 0xA1,  23}, {L'Ά', 0xA2,  69}, {L'―', 0xAF,  68},
	{0x98, 0x98,   7}, {L'’', 0x92,  72}, {0x9A, 0x9A,   2}, {L'΄', 0xB4,  74},
	{0x9C, 0x9C,   9}, {0x9D, 0x9D,  11}, {0x9E, 0x9E,   3}, {0x9F, 0x9F,  78},
	{NBSP, 0xA0,   5}, {L'‡', 0x87,  80}, {L'•', 0x95,  17}, {L'£', 0xA3,  81},
	{L'¤', 0xA4,  82}, {L'¥', 0xA5,  83}, {L'¦', 0xA6,   4}, {L'§', 0xA7,  85},
	{L'¨', 0xA8,  86}, {L'©', 0xA9,  87}, {L'Έ', 0xB8,  88}, {L'«', 0xAB,  89},
	{L'¬', 0xAC,   0}, {SFHY, 0xAD,  91}, {L'®', 0xAE,  92}, {L'Ή', 0xB9,  75},
	{L'°', 0xB0,   6}, {L'±', 0xB1,  95}, {L'²', 0xB2,  96}, {L'³', 0xB3,  97},
	{L'Ί', 0xBA,  98}, {L'µ', 0xB5,  99}, {L'¶', 0xB6, 100}, {L'·', 0xB7, 101},
	{L'Ό', 0xBC, 102}, {L'‹', 0x8B, 103}, {L'›', 0x9B, 104}, {L'»', 0xBB, 105},
	{L'Ύ', 0xBE, 106}, {L'½', 0xBD, 107}, {L'Ώ', 0xBF, 108}, {L'ΐ', 0xC0, 109},
	{L'Α', 0xC1, 110}, {L'Β', 0xC2, 111}, {L'Γ', 0xC3, 112}, {L'Δ', 0xC4, 113},
	{L'Ε', 0xC5,  70}, {L'Ζ', 0xC6,  94}, {L'Η', 0xC7,  79}, {L'Θ', 0xC8, 117},
	{L'Ι', 0xC9, 118}, {L'Κ', 0xCA, 119}, {L'Λ', 0xCB,  84}, {L'Μ', 0xCC,  93},
	{L'Ν', 0xCD, 124}, {L'Ξ', 0xCE, 125}, {L'Ο', 0xCF, 126}, {L'Π', 0xD0, 114},
	{L'Ρ', 0xD1,  80}, {L'Σ', 0xD3,  81}, {L'Τ', 0xD4,  82}, {L'Υ', 0xD5,  83},
	{L'Φ', 0xD6, 120}, {L'Χ', 0xD7,  85}, {L'Ψ', 0xD8,  86}, {L'Ω', 0xD9,  87},
	{L'Ϊ', 0xDA,  88}, {L'Ϋ', 0xDB,  89}, {L'ά', 0xDC,  90}, {L'έ', 0xDD,  91},
	{L'ή', 0xDE,  92}, {L'ί', 0xDF, 123}, {L'ΰ', 0xE0, 115}, {L'α', 0xE1,  95},
	{L'β', 0xE2,  96}, {L'γ', 0xE3,  97}, {L'δ', 0xE4,  98}, {L'ε', 0xE5,  99},
	{L'ζ', 0xE6, 100}, {L'η', 0xE7, 101}, {L'θ', 0xE8, 102}, {L'ι', 0xE9, 103},
	{L'κ', 0xEA, 104}, {L'λ', 0xEB, 105}, {L'μ', 0xEC, 106}, {L'ν', 0xED, 107},
	{L'ξ', 0xEE, 108}, {L'ο', 0xEF, 109}, {L'π', 0xF0, 110}, {L'ρ', 0xF1, 111},
	{L'ς', 0xF2, 112}, {L'σ', 0xF3, 113}, {L'τ', 0xF4, 116}, {L'υ', 0xF5, 115},
	{L'φ', 0xF6, 116}, {L'χ', 0xF7, 117}, {L'ψ', 0xF8, 118}, {L'ω', 0xF9, 119},
	{L'ϊ', 0xFA, 120}, {F8F9, 0xAA, 121}, {F8FA, 0xD2, 122}, {L'ϋ', 0xFB, 127},
	{L'ό', 0xFC, 124}, {L'ύ', 0xFD, 125}, {L'ώ', 0xFE, 126}, {F8FB, 0xFF, 127}
};

struct hash_table const unicode_macroman_array[] =
{
	{L'•', 0xA5,   1}, {L'™', 0xAA,  16}, {L'≠', 0xAD,   5}, {L'≤', 0xB2,   3},
	{L'≥', 0xB3,   4}, {L'∂', 0xB6,  21}, {L'∆', 0xC6,   6}, {L'«', 0xC7,   7},
	{L'…', 0xC9,   8}, {NBSP, 0xCA,   9}, {L'À', 0xCB,  10}, {L'Ÿ', 0xD9,  11},
	{L'⁄', 0xDA,  12}, {L'€', 0xDB,  13}, {L'›', 0xDD,  14}, {L'∏', 0xB8,  15},
	{L'ﬁ', 0xDE,  16}, {L'∑', 0xB7,  17}, {L'ƒ', 0xC4,  18}, {L'–', 0xD0,  19},
	{L'—', 0xD1,  20}, {L'ﬂ', 0xDF,  21}, {L'‡', 0xE0,  22}, {L'‚', 0xE2,  23},
	{L'‘', 0xD4,  24}, {L'’', 0xD5,  25}, {L'√', 0xC3,  23}, {L'„', 0xE3,  27},
	{L'“', 0xD2,  28}, {L'”', 0xD3,  29}, {L'∞', 0xB0,  27}, {L'‰', 0xE4,  31},
	{L'†', 0xA0,   9}, {L'¡', 0xC1,  22}, {L'¢', 0xA2,   0}, {L'£', 0xA3,  35},
	{L'Ê', 0xE6,  36}, {L'¥', 0xB4,  37}, {L'Ω', 0xBD,   8}, {L'§', 0xA4,  39},
	{L'¨', 0xAC,  40}, {L'©', 0xA9,  41}, {L'ª', 0xBB,  42}, {L'∫', 0xBA,   7},
	{L'¬', 0xC2,  13}, {L'È', 0xE9,  45}, {L'®', 0xA8,  46}, {L'Ó', 0xEE,  62},
	{L'°', 0xA1,  31}, {L'±', 0xB1,  56}, {L'', 0xF0,  50}, {L'Ò', 0xF1,  51},
	{L'´', 0xAB,  52}, {L'µ', 0xB5,  53}, {L'¶', 0xA6,  54}, {L'·', 0xE1,  55},
	{L'ı', 0xF5,  94}, {L'‹', 0xDC,  57}, {L'º', 0xBC,  14}, {L'»', 0xC8,  59},
	{L'ˆ', 0xF6,  60}, {L'˜', 0xF7,  61}, {L'¯', 0xF8,  62}, {L'¿', 0xC0,  63},
	{L'π', 0xB9,  10}, {L'Á', 0xE7,  65}, {L'Â', 0xE5,  66}, {L'Ã', 0xCC,  67},
	{L'Ä', 0x80,  12}, {L'Å', 0x81,  69}, {L'Æ', 0xAE,  60}, {L'Ç', 0x82, 126},
	{L'≈', 0xC5,  45}, {L'É', 0x83,  73}, {L'◊', 0xD7,  36}, {L'Ë', 0xE8,  75},
	{L'Ì', 0xED,  76}, {L'Í', 0xEA,  77}, {L'Î', 0xEB,  78}, {L'Ï', 0xEC,  79},
	{L'˘', 0xF9,  80}, {L'Ñ', 0x84,  81}, {L'Œ', 0xCE,  51}, {L'œ', 0xCF,  47},
	{L'Ô', 0xEF,  84}, {L'Õ', 0xCD,  85}, {L'Ö', 0x85,  86}, {L'˙', 0xFA,  87},
	{L'Ø', 0xAF,  80}, {L'Ù', 0xF4,  87}, {L'Ú', 0xF2,  93}, {L'Û', 0xF3, 125},
	{L'Ü', 0x86,  61}, {L'˚', 0xFB, 112}, {L'¸', 0xFC,  94}, {L'ß', 0xA7,  95},
	{L'à', 0x88,   2}, {L'á', 0x87,  97}, {L'â', 0x89,  98}, {L'ã', 0x8B,  99},
	{L'ä', 0x8A,   3}, {L'å', 0x8C,   4}, {L'æ', 0xBE, 102}, {L'ç', 0x8D, 103},
	{L'è', 0x8F, 104}, {L'é', 0x8E, 105}, {L'ê', 0x90, 106}, {L'ë', 0x91, 107},
	{L'ì', 0x93, 108}, {L'í', 0x92, 109}, {L'î', 0x94, 110}, {L'ï', 0x95, 111},
	{L'˝', 0xFD, 112}, {L'ñ', 0x96, 113}, {L'ò', 0x98, 114}, {L'ó', 0x97, 115},
	{L'ô', 0x99, 116}, {L'õ', 0x9B, 117}, {L'ö', 0x9A, 118}, {L'÷', 0xD6, 119},
	{L'ø', 0xBF,  11}, {L'ù', 0x9D, 121}, {L'ú', 0x9C, 122}, {L'û', 0x9E, 123},
	{L'ü', 0x9F, 124}, {L'˛', 0xFE, 125}, {L'ˇ', 0xFF, 126}, {L'ÿ', 0xD8,  50}
};

struct hash_table const unicode_macgreek_array[] =
{
	{L'•', 0x96,   0}, {L'Π', 0xA6,  15}, {L'Σ', 0xAA,   2}, {L'≠', 0xAD,   3},
	{L'΄', 0x8B,   4}, {L'΅', 0x87,   5}, {L'°', 0xAE,  52}, {L'·', 0xAF,   7},
	{L'≤', 0xB2,  53}, {L'Φ', 0xBC,  14}, {L'Ψ', 0xBE,  64}, {L'Ω', 0xBF,  11},
	{L'¬', 0xC2,  65}, {L'«', 0xC7,  13}, {L'…', 0xC9,  63}, {NBSP, 0xCA,  71},
	{L'Υ', 0xCB, 125}, {L'Α', 0xB0,  17}, {L'Β', 0xB5,  18}, {L'Γ', 0xA1,  54},
	{L'Δ', 0xA2,  20}, {L'Ε', 0xB6,  55}, {L'Ζ', 0xB7,  22}, {L'Η', 0xB8,  23},
	{L'Θ', 0xA3,  60}, {L'Ι', 0xB9,  62}, {L'Κ', 0xBA,  26}, {L'Λ', 0xA4,  27},
	{L'Μ', 0xBB,  56}, {L'Ν', 0xC1,  58}, {L'Ξ', 0xA5,  30}, {L'Ο', 0xC3,  31},
	{L'†', 0xA0,   1}, {L'Ρ', 0xC4,  33}, {L'™', 0x93,   0}, {L'£', 0x92,   2},
	{L'Τ', 0xC6,  36}, {L'¥', 0xB4,  16}, {L'¦', 0x9B,   9}, {L'§', 0xAC,  47},
	{L'¨', 0x8C,  10}, {L'©', 0xA9,  11}, {L'Ϊ', 0xAB,  42}, {L'Ϋ', 0xBD,  13},
	{L'ά', 0xC0,  12}, {SFHY, 0x9C,  67}, {L'®', 0xA8,  69}, {L'Χ', 0xCC,  70},
	{L'‰', 0x98,   6}, {L'±', 0xB1,  74}, {L'²', 0x82,  75}, {L'³', 0x84,  82},
	{L'Ά', 0xCD,  79}, {L'Έ', 0xCE,  80}, {L'–', 0xD0, 117}, {L'―', 0xD1,  84},
	{L'“', 0xD2, 109}, {L'¹', 0x81,  85}, {L'”', 0xD3,  88}, {L'»', 0xC8,  89},
	{L'‘', 0xD4,  90}, {L'½', 0x97,  91}, {L'’', 0xD5,  87}, {L'Ή', 0xD7,  66},
	{L'Ί', 0xD8,  94}, {L'Ό', 0xD9,  99}, {L'Ύ', 0xDA,  93}, {L'έ', 0xDB, 102},
	{L'Ä', 0x80, 108}, {L'ή', 0xDC, 115}, {L'ί', 0xDD,  81}, {L'Ώ', 0xDF, 114},
	{L'≈', 0xC5,  78}, {L'É', 0x83, 112}, {L'α', 0xE1, 120}, {L'β', 0xE2, 122},
	{L'ό', 0xDE,  76}, {L'ύ', 0xE0,  77}, {L'ψ', 0xE3,  97}, {L'δ', 0xE4, 126},
	{L'ε', 0xE5,  80}, {L'φ', 0xE6,  81}, {L'γ', 0xE7,  82}, {L'œ', 0xCF,  83},
	{L'η', 0xE8,  84}, {L'ι', 0xE9,  85}, {L'Ö', 0x85,  86}, {L'ξ', 0xEA,  87},
	{L'κ', 0xEB,  88}, {L'λ', 0xEC,  89}, {L'μ', 0xED,  90}, {L'ν', 0xEE,  91},
	{L'Ü', 0x86,  92}, {L'ο', 0xEF, 113}, {L'π', 0xF0,  94}, {L'ß', 0xA7,  95},
	{L'à', 0x88,   3}, {L'ώ', 0xF1,  97}, {L'â', 0x89,  98}, {L'ρ', 0xF2,  99},
	{L'ä', 0x8A,   8}, {L'≥', 0xB3, 101}, {L'σ', 0xF3, 102}, {L'ç', 0x8D, 103},
	{L'è', 0x8F, 104}, {L'é', 0x8E, 105}, {L'ê', 0x90, 106}, {L'ë', 0x91, 107},
	{L'τ', 0xF4, 108}, {L'θ', 0xF5, 109}, {L'î', 0x94, 110}, {L'ï', 0x95, 111},
	{L'ω', 0xF6, 112}, {L'ς', 0xF7, 113}, {L'χ', 0xF8, 127}, {L'υ', 0xF9, 115},
	{L'ô', 0x99, 116}, {L'ζ', 0xFA, 117}, {L'ö', 0x9A, 118}, {L'÷', 0xD6, 119},
	{L'ϊ', 0xFB, 120}, {L'ù', 0x9D, 121}, {L'ϋ', 0xFC, 122}, {L'û', 0x9E, 123},
	{L'ü', 0x9F, 124}, {L'ΐ', 0xFD, 125}, {L'ΰ', 0xFE, 126}, {F8A0, 0xFF, 127}
};

struct hash_table const unicode_macce_array[] =
{
	{L'Ā', 0x81,   0}, {L'ā', 0x82,   1}, {L'ú', 0x9C,  16}, {L'™', 0xAA, 120},
	{L'Ą', 0x84,   4}, {L'ą', 0x88,   5}, {L'Ć', 0x8C,  28}, {L'ć', 0x8D,   7},
	{L'ģ', 0xAE,   8}, {L'Į', 0xAF,   9}, {L'≤', 0xB2,  78}, {L'Ķ', 0xB5,  11},
	{L'Č', 0x89,  12}, {L'č', 0x8B,  13}, {L'Ď', 0x91,  14}, {L'ď', 0x93,  15},
	{L'∂', 0xB6,  16}, {L'∑', 0xB7,  17}, {L'Ē', 0x94,  18}, {L'ē', 0x95,  33},
	{L'√', 0xC3,  36}, {L'ń', 0xC4,  21}, {L'Ė', 0x96,  22}, {L'ė', 0x98,  23},
	{L'Ę', 0xA2,  49}, {L'ę', 0xAB,  50}, {L'Ě', 0x9D,  20}, {L'ě', 0x9E,  27},
	{L'∆', 0xC6,  37}, {L'«', 0xC7,  45}, {L'»', 0xC8,  64}, {NBSP, 0xCA,  31},
	{L'†', 0xA0,  31}, {L'–', 0xD0,  33}, {L'•', 0xA5,   3}, {L'£', 0xA3,   8},
	{L'—', 0xD1,  63}, {L'“', 0xD2,  37}, {L'…', 0xC9,  38}, {L'§', 0xA4,  39},
	{L'¨', 0xAC,  40}, {L'©', 0xA9,  41}, {L'Ī', 0xB1,  42}, {L'ī', 0xB4,  29},
	{L'¬', 0xC2,  44}, {L'”', 0xD3,  45}, {L'®', 0xA8,   9}, {L'į', 0xB0,  47},
	{L'°', 0xA1,  48}, {L'‘', 0xD4,  49}, {L'’', 0xD5,  50}, {L'ŕ', 0xDA,  51},
	{L'‹', 0xDC,  52}, {L'›', 0xDD,  53}, {L'¶', 0xA6,  11}, {L'Ŗ', 0xDF, 103},
	{L'Š', 0xE1,  56}, {L'Ĺ', 0xBD,  52}, {L'ĺ', 0xBE,  53}, {L'Ļ', 0xB9,  30},
	{L'ļ', 0xBA,  60}, {L'Ľ', 0xBB,  61}, {L'ľ', 0xBC,  62}, {L'‚', 0xE2,  63},
	{L'„', 0xE3,  64}, {L'š', 0xE4,  75}, {L'ł', 0xB8,  66}, {L'Ń', 0xC1,  67},
	{L'Ä', 0x80,  21}, {L'Ņ', 0xBF,  69}, {L'ņ', 0xC0,  70}, {L'Ň', 0xC5, 127},
	{L'ň', 0xCB,  72}, {L'É', 0x83,  73}, {L'◊', 0xD7,  74}, {L'Á', 0xE7, 104},
	{L'Ō', 0xCF,  76}, {L'ō', 0xD8,  82}, {L'Ť', 0xE8,  78}, {L'ť', 0xE9,  79},
	{L'Ő', 0xCC,  80}, {L'ő', 0xCE,  81}, {L'Í', 0xEA,  82}, {L'Ó', 0xEE,  83},
	{L'Ŕ', 0xD9,  93}, {L'Õ', 0xCD,  51}, {L'Ö', 0x85,  55}, {L'ŗ', 0xE0,  87},
	{L'Ř', 0xDB,  88}, {L'ř', 0xDE,  89}, {L'Ś', 0xE5,  94}, {L'ś', 0xE6,  91},
	{L'Ü', 0x86,  92}, {L'Ô', 0xEF,  99}, {L'Ú', 0xF2,  94}, {L'ß', 0xA7,  95},
	{L'≠', 0xAD,  56}, {L'á', 0x87,  65}, {L'ų', 0xF7,  98}, {L'Ý', 0xF8,  99},
	{L'ä', 0x8A,  10}, {L'≥', 0xB3,  79}, {L'ý', 0xF9, 102}, {L'ķ', 0xFA, 103},
	{L'Ł', 0xFC, 104}, {L'é', 0x8E, 105}, {L'Ū', 0xED, 106}, {L'ū', 0xF0, 107},
	{L'ż', 0xFD, 108}, {L'í', 0x92, 109}, {L'Ů', 0xF1, 110}, {L'ů', 0xF3, 111},
	{L'Ű', 0xF4, 112}, {L'ű', 0xF5, 113}, {L'Ų', 0xF6, 114}, {L'ó', 0x97,  98},
	{L'ô', 0x99, 116}, {L'õ', 0x9B, 117}, {L'ö', 0x9A, 118}, {L'÷', 0xD6, 119},
	{L'Ģ', 0xFE, 120}, {L'Ź', 0x8F, 121}, {L'ź', 0x90,   2}, {L'Ż', 0xFB, 123},
	{L'ü', 0x9F, 108}, {L'Ž', 0xEB, 102}, {L'ž', 0xEC, 126}, {L'ˇ', 0xFF, 127}
};

struct hash_table const unicode_ibm850_array[] =
{
	{L'▒', 0xB1,   5}, {L'║', 0xBA,   1}, {L'│', 0xB3,   2}, {L'╗', 0xBB,   3},
	{L'┬', 0xC2,  21}, {L'─', 0xC4,  22}, {L'┼', 0xC5,   6}, {L'ã', 0xC6,   7},
	{L'╩', 0xCA,  15}, {L'╦', 0xCB,   9}, {L'╠', 0xCC,  10}, {L'╬', 0xCE,  11},
	{L'¤', 0xCF,  14}, {L'Ð', 0xD1,  13}, {L'┌', 0xDA,  14}, {L'█', 0xDB,  15},
	{L'┐', 0xBF,  16}, {L'░', 0xB0,  17}, {L'ƒ', 0x9F,   0}, {L'▓', 0xB2,  19},
	{L'└', 0xC0,  20}, {L'▄', 0xDC,  21}, {L'▀', 0xDF,  22}, {L'Ô', 0xE2,  30},
	{L'┘', 0xD9,  24}, {L'Ú', 0xE9,  25}, {L'Ý', 0xED,  26}, {L'´', 0xEF,  27},
	{L'├', 0xC3,  28}, {L'±', 0xF1,  29}, {L'‗', 0xF2,  30}, {NBSP, 0xFF,  31},
	{L'■', 0xFE,  31}, {L'¡', 0xAD,  33}, {L'¢', 0xBD,  34}, {L'£', 0x9C,  35},
	{L'┤', 0xB4,  12}, {L'¥', 0xBE,  37}, {L'¦', 0xDD,  38}, {L'§', 0xF5,  39},
	{L'¨', 0xF9,  40}, {L'©', 0xB8,  41}, {L'ª', 0xA6,  42}, {L'«', 0xAE,  43},
	{L'¬', 0xAA,   4}, {SFHY, 0xF0,  45}, {L'®', 0xA9,  46}, {L'¯', 0xEE,  47},
	{L'°', 0xF8,  48}, {L'ı', 0xD5,  29}, {L'²', 0xFD,  50}, {L'³', 0xFC,  51},
	{L'┴', 0xC1,  27}, {L'µ', 0xE6,  53}, {L'¶', 0xF4,  54}, {L'·', 0xFA,  55},
	{L'¸', 0xF7,  56}, {L'¹', 0xFB,  57}, {L'º', 0xA7,  58}, {L'»', 0xAF,  59},
	{L'¼', 0xAC,   6}, {L'½', 0xAB,  61}, {L'¾', 0xF3,  62}, {L'¿', 0xA8,  63},
	{L'À', 0xB7,  64}, {L'Á', 0xB5,  65}, {L'Â', 0xB6,  66}, {L'Ã', 0xC7,  67},
	{L'Ä', 0x8E,  68}, {L'Å', 0x8F,  69}, {L'Æ', 0x92,  70}, {L'Ç', 0x80,  71},
	{L'È', 0xD4,  72}, {L'É', 0x90,  73}, {L'Ê', 0xD2,  74}, {L'Ë', 0xD3,  75},
	{L'Ì', 0xDE,  76}, {L'Í', 0xD6,  77}, {L'Î', 0xD7,  78}, {L'Ï', 0xD8,  79},
	{L'═', 0xCD,  13}, {L'Ñ', 0xA5,   1}, {L'Ò', 0xE3,  82}, {L'Ó', 0xE0,  83},
	{L'╔', 0xC9,  23}, {L'Õ', 0xE5,  85}, {L'Ö', 0x99,  86}, {L'×', 0x9E,   3},
	{L'Ø', 0x9D,  88}, {L'Ù', 0xEB,  89}, {L'╚', 0xC8,  25}, {L'Û', 0xEA,  91},
	{L'Ü', 0x9A,  92}, {L'╝', 0xBC,  26}, {L'Þ', 0xE8,  94}, {L'ß', 0xE1,  95},
	{L'à', 0x85,  10}, {L'á', 0xA0,  97}, {L'â', 0x83,  98}, {L'╣', 0xB9,   7},
	{L'ä', 0x84, 100}, {L'å', 0x86, 101}, {L'æ', 0x91,   9}, {L'ç', 0x87, 103},
	{L'è', 0x8A, 104}, {L'é', 0x82,   8}, {L'ê', 0x88, 106}, {L'ë', 0x89, 107},
	{L'ì', 0x8D,  11}, {L'í', 0xA1, 109}, {L'î', 0x8C, 110}, {L'ï', 0x8B, 111},
	{L'ð', 0xD0, 112}, {L'ñ', 0xA4, 113}, {L'ò', 0x95, 114}, {L'ó', 0xA2, 115},
	{L'ô', 0x93, 116}, {L'õ', 0xE4, 117}, {L'ö', 0x94, 118}, {L'÷', 0xF6, 119},
	{L'ø', 0x9B, 120}, {L'ù', 0x97, 121}, {L'ú', 0xA3, 122}, {L'û', 0x96, 123},
	{L'ü', 0x81, 124}, {L'ý', 0xEC, 125}, {L'þ', 0xE7, 126}, {L'ÿ', 0x98, 127}
};

struct hash_table const unicode_ibm852_array[] =
{
	{L'Ť', 0x9B,  15}, {L'ź', 0xAB,   1}, {L'│', 0xB3,  21}, {L'Á', 0xB5,  22},
	{L'Ą', 0xA4,  41}, {L'ą', 0xA5,   5}, {L'Ć', 0x8F,   6}, {L'ć', 0x86,   7},
	{L'Â', 0xB6,  40}, {L'║', 0xBA,   9}, {L'╗', 0xBB,  10}, {L'ż', 0xBE,  11},
	{L'Č', 0xAC,  39}, {L'č', 0x9F,  13}, {L'┬', 0xC2,  33}, {L'─', 0xC4,  34},
	{L'┐', 0xBF,  32}, {L'░', 0xB0,  31}, {L'▒', 0xB1,  18}, {L'▓', 0xB2,  19},
	{L'└', 0xC0,  20}, {L'Ă', 0xC6,  21}, {L'ă', 0xC7,  22}, {L'╚', 0xC8,  54},
	{L'Ę', 0xA8,  38}, {L'ę', 0xA9,  25}, {L'Ě', 0xB7,  26}, {L'╩', 0xCA,  37},
	{L'├', 0xC3,  28}, {L'═', 0xCD,  29}, {L'¤', 0xCF,  30}, {L'đ', 0xD0,  31},
	{L'Đ', 0xD1, 120}, {L'Ď', 0xD2,  33}, {L'ď', 0xD4,  46}, {L'Ň', 0xD5,  76},
	{L'┤', 0xB4,  30}, {L'ě', 0xD8,  37}, {L'┘', 0xD9,  38}, {L'┌', 0xDA,  79},
	{L'█', 0xDB, 104}, {L'▄', 0xDC,  41}, {L'Ţ', 0xDD,  42}, {L'«', 0xAE,  43},
	{L'¬', 0xAA,  14}, {L'Ů', 0xDE,  69}, {L'▀', 0xDF,  46}, {L'ß', 0xE1,  47},
	{L'Ô', 0xE2,  53}, {L'ń', 0xE4,  49}, {L'Š', 0xE6,  50}, {L'š', 0xE7,  51},
	{L'┴', 0xC1,  64}, {L'Ŕ', 0xE8,  89}, {L'Ú', 0xE9,  54}, {L'ý', 0xEC,  55},
	{L'Ý', 0xED,  70}, {L'Ĺ', 0x91,  57}, {L'ĺ', 0x92,  58}, {L'»', 0xAF,  59},
	{L'┼', 0xC5,  60}, {L'Ľ', 0x95,  61}, {L'ľ', 0x96,  62}, {L'ţ', 0xEE,  63},
	{L'´', 0xEF,  64}, {L'Ł', 0x9D,   3}, {L'ł', 0x88,   8}, {L'Ń', 0xE3,  67},
	{L'Ä', 0x8E,  49}, {SFHY, 0xF0,  69}, {L'˝', 0xF1,  82}, {L'Ç', 0x80,  35},
	{L'ň', 0xE5,  72}, {L'É', 0x90,  73}, {L'˛', 0xF2,  74}, {L'Ë', 0xD3,  75},
	{L'ˇ', 0xF3,  76}, {L'Í', 0xD6,  77}, {L'Î', 0xD7,  78}, {L'§', 0xF5,  79},
	{L'Ő', 0x8A,  29}, {L'ő', 0x8B,   9}, {L'¸', 0xF7,  82}, {L'Ó', 0xE0,  83},
	{L'╔', 0xC9,  48}, {L'ŕ', 0xEA,  85}, {L'Ö', 0x99,  86}, {L'×', 0x9E,  10},
	{L'˘', 0xF4, 114}, {L'°', 0xF8, 106}, {L'Ś', 0x97,  23}, {L'ś', 0x98,  74},
	{L'Ü', 0x9A,  92}, {L'╝', 0xBC,  56}, {L'Ş', 0xB8,  94}, {L'ş', 0xAD,  47},
	{L'╠', 0xCC,  50}, {L'á', 0xA0,  51}, {L'â', 0x83,  42}, {L'╣', 0xB9,  63},
	{L'ä', 0x84,   0}, {L'ť', 0x9C, 101}, {L'╦', 0xCB, 102}, {L'ç', 0x87, 103},
	{L'¨', 0xF9, 104}, {L'é', 0x82,  27}, {L'˙', 0xFA, 117}, {L'ë', 0x89, 107},
	{L'╬', 0xCE, 108}, {L'í', 0xA1, 109}, {L'î', 0x8C,  45}, {L'ů', 0x85, 111},
	{L'Ű', 0xEB, 112}, {L'ű', 0xFB, 113}, {L'Ř', 0xFC, 114}, {L'ó', 0xA2, 115},
	{L'ô', 0x93, 116}, {L'ř', 0xFD, 117}, {L'ö', 0x94, 118}, {L'÷', 0xF6, 119},
	{L'■', 0xFE, 127}, {L'Ź', 0x8D, 121}, {L'ú', 0xA3,   1}, {L'Ż', 0xBD, 123},
	{L'ü', 0x81,  11}, {L'Ž', 0xA6,  55}, {L'ž', 0xA7, 126}, {NBSP, 0xFF, 127}
};
// clang-format on

/*******************************************************************************
 * functions
 */

static unsigned char ENCiGetLatinCharFromHashTable(
	struct hash_table const *table, char16_t src)
{
	u8 hash = src % 128;

	while (src != table[hash].c16)
	{
		if (hash == table[hash].next)
			return 0;

		hash = table[hash].next;
	}

	return table[hash].cc;
}

ENCResult ENCiConvertStringLatinToUnicode(char16_t *dst, unk4_t signed *dstSize,
                                          unsigned char const *src,
                                          unk4_t signed *srcSize,
                                          ENCBreakType breakType,
                                          char16_t const *table)
{
	CREATE_STATE_VARIABLES(dstCnt, dstLimit, dstValid, srcCnt, srcLimit,
	                       srcLimited)

	ENCResult ret;

	CHECK_PARAMETERS(dst, dstSize, dstLimit, dstValid, src, srcSize, srcLimit,
	                 srcLimited, ret);

	while (*src && (srcCnt < srcLimit || !srcLimited))
	{
		unsigned char cur = *src;
		char16_t c16 = L'\0';

		CHECK_DST_SPACE(dstCnt, dstLimit, dstValid, ret);

		CHECK_BREAK_TYPE(dst, dstCnt, dstLimit, dstValid, src, srcCnt, srcLimit,
		                 srcLimited, breakType, ret);

		if (cur >= 0x80) // NOTE: Do not use !IS_ASCII(cur) here
			c16 = table[cur - 0x80];
		else
			c16 = cur;

		if (!c16)
		{
			THROW_AND_QUIT(ret, ENC_E2);
		}

		COPY_CHAR_AS_IS(c16, dst, dstCnt, dstValid, src, srcCnt);
	}

	WRITE_BACK_SIZES(srcSize, srcCnt, dstSize, dstCnt);

	return ret;
}

ENCResult ENCiConvertStringUnicodeToLatin(unsigned char *dst,
                                          unk4_t signed *dstSize,
                                          char16_t const *src,
                                          unk4_t signed *srcSize,
                                          ENCBreakType breakType,
                                          struct hash_table const *table)
{
	CREATE_STATE_VARIABLES(dstCnt, dstLimit, dstValid, srcCnt, srcLimit,
	                       srcLimited)

	ENCResult ret;

	CHECK_PARAMETERS(dst, dstSize, dstLimit, dstValid, src, srcSize, srcLimit,
	                 srcLimited, ret);

	UTF16_CHECK_BOM(src, srcSize, srcLimit, srcLimited, srcCnt, dstSize);

	while (*src && (srcCnt < srcLimit || !srcLimited))
	{
		char16_t cur = *src;
		unsigned char cc = '\0';

		CHECK_DST_SPACE(dstCnt, dstLimit, dstValid, ret);

		CHECK_BREAK_TYPE(dst, dstCnt, dstLimit, dstValid, src, srcCnt, srcLimit,
		                 srcLimited, breakType, ret);

		// reversed from above idk
		if (IS_ASCII(cur))
			cc = cur;
		else
			cc = ENCiGetLatinCharFromHashTable(table, cur);

		if (!cc)
			THROW_AND_QUIT(ret, ENC_E2);

		COPY_CHAR_AS_IS(cc, dst, dstCnt, dstValid, src, srcCnt);
	}

	WRITE_BACK_SIZES(srcSize, srcCnt, dstSize, dstCnt);

	return ret;
}

DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Latin1, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Latin1, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Latin2, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Latin2, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Latin3, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Latin3, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Greek, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Greek, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Latin6, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Latin6, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Latin9, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Latin9, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16_VIA(Win1252, unsigned char, Latin1)
DEFINE_PUBLIC_ENC_TRAMPOLINE_FROM_UTF16(Win1252, unsigned char)

// All of these are only convertible from, not to
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Win1250, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Win1253, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Macroman, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Macgreek, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Macce, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Ibm850, unsigned char)
DEFINE_PUBLIC_ENC_TRAMPOLINE_TO_UTF16(Ibm852, unsigned char)

// Second trampoline into internal generic extASCII <=> Unicode conversion functions

DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Latin1, unsigned char, latin1_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Latin1, unsigned char, unicode_latin1_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Latin2, unsigned char, latin2_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Latin2, unsigned char, unicode_latin2_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Latin3, unsigned char, latin3_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Latin3, unsigned char, unicode_latin3_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Greek, unsigned char, greek_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Greek, unsigned char, unicode_greek_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Latin6, unsigned char, latin6_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Latin6, unsigned char, unicode_latin6_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Latin9, unsigned char, latin9_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Latin9, unsigned char, unicode_latin9_array)
DEFINE_PRIVATE_TRAMPOLINE_FROM_UTF16(Win1252, unsigned char, unicode_win1252_array)

// All of these are only convertible from, not to
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Win1250, unsigned char, win1250_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Win1253, unsigned char, win1253_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Macroman, unsigned char, macroman_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Macgreek, unsigned char, macgreek_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Macce, unsigned char, macce_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Ibm850, unsigned char, ibm850_unicode_array)
DEFINE_PRIVATE_TRAMPOLINE_TO_UTF16(Ibm852, unsigned char, ibm852_unicode_array)
